// morse 编码
  
//加密
function mosi(str){
  //创建字符数组
  var oldarr = [
      'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
      '1','2','3','4','5','6','7','8','9','0',
      '.',':',',',';','?','=',"'",'/','!','-','_','"','(',')','$','&','@','+',' '
  ]
  //创建对应的密文数组
  var newarr = [
      '.-','-...','-.-.','-..','.','..-.','--.','....','..','.---','-.-','.-..','--','-.','---','.--.','--.-','.-.','...','-','..-','...-','.--','-..-','-.--','--..',
      '.----','..---','...--','....-','.....','-....','--...','---..','----.','-----',
      '.-.-.-','---...','--..--','-.-.-.','..--..','-...-','.----.','-..-.','-.-.--','-....-','..--.-','.-..-.','-.--.','-.--.-','...-..-','.-...','.--.-.','.-.-.',' '
  ]
  //将小写字母全部转化为大写字母处理
  var strin=str.toUpperCase();
  var size;
  var value="";
  //循环处理字符串每一个元素
  for(i=0;i<str.length;i++){
      //获取该元素在对应的字符数组中的位置
      size=oldarr.indexOf(strin.charAt(i));
      //获取该位置对应的密文数组中的密文，添加空格隔开加入字符串中
      value += newarr[size] + " ";
  }
  //返回密文字符串
  return value;

}

function mosijie(str){
  //创建字符数组
  var oldarr = [
      'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
      '1','2','3','4','5','6','7','8','9','0',
      '.',':',',',';','?','=',"'",'/','!','-','_','"','(',')','$','&','@','+',' '
  ]
  //创建对应的密文数组
  var newarr = [
      '.-','-...','-.-.','-..','.','..-.','--.','....','..','.---','-.-','.-..','--','-.','---','.--.','--.-','.-.','...','-','..-','...-','.--','-..-','-.--','--..',
      '.----','..---','...--','....-','.....','-....','--...','---..','----.','-----',
      '.-.-.-','---...','--..--','-.-.-.','..--..','-...-','.----.','-..-.','-.-.--','-....-','..--.-','.-..-.','-.--.','-.--.-','...-..-','.-...','.--.-.','.-.-.',' '
  ]
  //定义一个空数组
  var strarr=[];
  //将输入的字符串以空格为分界线取出存入数组中
  strarr=str.split(" ");
  var size;
  var value="";
  //循环处理数组中的每一个元素
  for(i=1;i<strarr.length;i++){
      //获取该密文在密文数组中的位置
      size = newarr.indexOf(strarr[i-1]);
      //如果该位置对应的字符数组中的值为空，就在字符串中添加一个空格
      if(oldarr[size]==null){
          value += " ";
      }
      //如果不为空，就将该位置对应的字符数组中的值添加入字符串中
      else{
          value += oldarr[size]
      }
      
  }
  //返回解密后的字符串
  return value;
}